name: "distilbert_tf"
platform: "tensorflow_savedmodel"
max_batch_size: 128
input: [
    {
        name: "attention_mask"
        data_type: TYPE_INT32
        dims: [ -1 ]
    },
    {
        name: "input_ids"
        data_type: TYPE_INT32
        dims: [ -1 ]
    }
]
output: [
    {
        name: "logits"
        data_type: TYPE_FP32
        dims: [ 2 ]
    }
]
instance_group {
  count: 1
  kind: KIND_GPU
}
dynamic_batching {
  preferred_batch_size: 16
}
